package f.object.ex1;

//접근제한제(public) class 클래스명{
//  필드
//	메소드
//}

//보통 Run이라고 생성하는 class는 객체생성을 위한 class가 아니라 main문을 통해 프로그램 실행을 위한 클래스다.
public class Run {
	/*
	 * 1. 객체지향 언어 : "객체"를 지향하는 언어로 "객체중심"으로 돌아간다.
	 * 
	 * 2. 객체란 : 현실세계에서 독립적(목적이 있고 가치가 있는 것)으로 존재하는 모든 것을 의미한다.
	 * 			 현실세계에서는 객체들간의 상호작용으로 돌아감.
	 * 
	 * 3. 객체지향 프로그래밍 : 현실세계의 객체들간의 상호작용 
	 *                    -> 프로그래밍을 통해서 가상세계로 구현하는 가장 효과적인 방법
	 * 4. 구현하고자 하는 프로그램상의 필요한 객체들을 만들기 위해서(즉, 생성하기 위해서) 클래스라는 설계도가 먼저 필요하다.
	 * 	  (클래스? 각 객체들의 속성(데이터)들을 담아낼 그릇같은 존재)
	 * 
	 * 5. 추상화 과정
	 * 	1) 내가 구현하고자 하는 프로그램에 필요한 객체들을 생각해 볼 것.
	 * 	2) 그 객체들의 공통적인 속성, 기능들을 추출할 것
	 * 	3) 추출한 것들을 가지고 내가 구현하고자하는 프로그램의 "실질적인 목적"에 맞춰 불필요한 속성, 기능을 제거할 것
	 * 
	 * 	ex) 학생 관리 프로그램
	 * 	  1) 학생관련 객체(최경제훈련생, 최용준훈령생, 안재휘훈련생등등...)
	 * 	  2) 공통적인 속성및 기능(이름, 나이, 주소, 전화번호, 키, 몸무게, 머리색, 발사이즈, 먹는다, 잔다, 공부한다.)
	 * 	  3) 학생 "인적사항"을 관리하는 프로그램 : 이름, 나이, 주소, 전화번호, 반....
	 * 	     학생 "성적"을 관리하는 프로그램 : 이름, 반, 과목별 점수.
	 * 	     학생 "건강"을 관리하는 프로그램 : 이름, 반, 키, 몸무게, 달리기 속도, 먹는다. 휴식한다.
	 * 	  4) 이름 : String name;
	 *	     나이 : int age;
	 * 	     키  : double height;
	 *       
	 * 
	 * 6.추상화한 객체를 프로그램에 적용시키기
	 *   1. "변수"만으로 프로그래밍을 한다.
	 *   	변수 : 하나의 자료형으로 하나의 값만을 보관할 수 있음.
	 *   	최경재라는 훈련생 객체 하나 만들기 -> String name1 = "최경재"; int age = 20; double height = 185;
	 *   	안재휘라는 훈련생 객체 하나 만들기 -> String name2 = "최경재"; int age = 19; double height = 193;
	 *   
	 *   2. 배열로 프로그래밍 한다면
	 *   	배열 : 하나의 자료형으로 여러개의 값들을 보관할 수 있음.
	 *   	이름을 보관하는 배열 String[] name = {"최경재", "안재휘"....}
	 *   	나이를 보관하는 배열 int[] age = {20, 19...}
	 *   	문제 -> 
	 *   
	 *   3.그래서 나온 개념 -> 구조체
	 *   구조체 : 여러개의 자료형의 여러개의 값들을 보관할 수 있다.
	 *   String값도 보관하고 int값도 보관하고 동시에 double값도 함께 보관하는 자료형을 직접 만든다고 생각 -> 나만의 자료형
	 *   Struct human{
	 *   	String name;
	 *   	int age;
	 *   	double height;
	 *   }
	 *   
	 *   -> 자바에서는 구조체 개념을 좀더 확장해서 클래스라는 개념을 만들었다.
	 */
	
	public static void main(String[] args) {
		//객체를 생성할 떄
		//class명 객체이름(참조변수);
//		Student choi;
//		choi = new Student();
		Student choi = new Student();
		Student kim =new Student();
		
		choi.name = "최지원";
		choi.age = 20;
		
		kim.name = "김수민";
		kim.age = 18;
		
//		kim = choi; //choi의 주소를 같이 쓰기 때문에 결과가 choi와 같아짐.
		
		choi.print();
		kim.print();
		
		
	}

}
